doom/config.el
(require 'f)
(require 's)
(require 'dash)

(setq rfc-mode-directory (expand-file-name "~/rfc/"))

(setq
 user-full-name "Ben O"
 user-mail-address "benny.ouattara@gmail.com"
 home-dir (getenv "HOME"))

(setq
 project-dir "~/Code"
 project-prefix "kata"
 skeletor-project-directory project-dir
 skeletor-user-directory (concat doom-private-dir "templates")
 skeletor-completing-read-function 'ivy-read)

(setq
 org-agenda-skip-scheduled-if-done t
 org-super-agenda-groups '((:name "Today"
                            :time-grid t
                            :scheduled today)
                           (:name "Due today"
                            :deadline today)
                           (:name "Important"
                            :priority "A")
                           (:name "Overdue"
                            :deadline past)
                           (:name "Due soon"
                            :deadline future)
                           (:name "Big Outcomes"
                            :tag "bo")))

(setq
 org-pomodoro-length 45
 org-pomodoro-short-break-length 15)

(if (equal "zangao" (user-login-name))
    (setq
     ;; doom-font (font-spec :family "monaco" :size 15 :weight 'normal)
     ;; doom-font (font-spec :family "JetBrains Mono" :size 19 :weight 'normal :width 'normal)
     ;; doom-variable-pitch-font (font-spec :family "Avenir Next" :size 21)
     doom-font (font-spec :family "Iosevka" :size 21 :weight 'normal)
     doom-big-font (font-spec :family "Iosevka" :size 27)
     doom-theme 'modus-operandi)
  (setq
   ;; doom-font (font-spec :family "monaco" :size 15 :weight 'normal)
   ;; doom-font (font-spec :family "JetBrains Mono" :size 19 :weight 'normal :width 'normal)
   ;; doom-variable-pitch-font (font-spec :family "Avenir Next" :size 21)
   doom-font (font-spec :family "Iosevka" :size 19 :weight 'normal)
   doom-big-font (font-spec :family "Iosevka" :size 25)
   doom-theme 'doom-palenight))

(setq
 mac-command-modifier 'meta
 ns-command-modifier 'meta
 confirm-kill-emacs nil
 evil-insert-state-cursor 'hbar
 evil-move-cursor-back nil
 display-line-numbers-type 'relative
 fancy-splash-image (expand-file-name "splash.png" doom-private-dir))

(menu-bar-mode -1)
(rainbow-mode)

(add-to-list 'default-frame-alist
             '(ns-transparent-titlebar . t))
(add-to-list 'default-frame-alist
             '(ns-appearance . dark))

;; (defun beno--auto-theme (appearance)
;;   "Load theme, taking current system APPEARANCE into consideration."
;;   (mapc #'disable-theme custom-enabled-themes)
;;   (pcase appearance
;;     ('light (load-theme 'doom-one-light t))
;;     ('dark (load-theme 'doom-snazzy t))))

(add-hook 'ns-system-appearance-change-functions #'beno--auto-theme)

(when (not (display-graphic-p))
  (progn
    (menu-bar-mode -1)
    (tool-bar-mode -1)
    (mapc #'disable-theme custom-enabled-themes)
    (setq doom-theme 'doom-acario-light
          evil-emacs-state-cursor '("red" box)
          evil-normal-state-cursor '("black" box)
          evil-visual-state-cursor '("black" box)
          evil-insert-state-cursor '("red" bar)
          evil-motion-state-cursor '("gray" box))))

(setq
 ;; org-ellipsis " ▾ "
 ;; org-ellipsis " ⤵ "
 ;; org-ellipsis " ↓ "
 ;; org-ellipsis " ∵ "
 ;; org-ellipsis " ⌄ "
 ;; org-ellipsis " ⁂ "
 org-startup-folded 'content
 org-auto-align-tags nil
 org-roam-v2-ack t
 +org-roam-open-buffer-on-find-file nil
 sync-dir "~/Sync/"
 org-directory (concat sync-dir "org")
 org-spotify-directory (concat org-directory "/spotify")
 org-mail-directory (concat org-directory "/mail.org")
 org-mime-export-options '(:section-numbers nil
                           :with-author nil
                           :with-toc nil)
 org-agenda-files (ignore-errors (directory-files org-directory t "\\.org$" t))
 ;; org-ellipsis " ≡ "
 org-ellipsis " ▾"
 org-hide-emphasis-markers t
 org-tags-column -80
 org-log-done 'time
 org-refile-targets (quote ((nil :maxlevel . 3)))
 +org-capture-todo-file "tasks.org")

(after! org
  (pushnew! org-capture-templates
            '("m" "Email workflow")
            '("mf" "Follow up" entry (file+olp org-mail-directory "Follow up")
              "* TODO follow up with %:fromname on %a\n\n%i"
              :immediate-finish t)
            '("mr" "Read later" entry (file+olp org-mail-directory "Read later")
              "* TODO read %:subject\n%a\n\n%i"
              :immediate-finish t)))

(setq-hook! org-mode
  prettify-symbols-alist '(("#+end_quote" . "”")
                           ("#+END_QUOTE" . "”")
                           ("#+begin_quote" . "“")
                           ("#+BEGIN_QUOTE" . "“")
                           ("#+end_src" . "«")
                           ("#+END_SRC" . "«")
                           ("#+begin_src" . "»")
                           ("#+BEGIN_SRC" . "»")
                           ("#+name:" . "»")
                           ("#+NAME:" . "»")))

(after! org-fancy-priorities
  (setq org-fancy-priorities-list '("⚡" "⬆" "⬇" "☕")))

(setq org-roam-dailies-capture-templates '(("d" "default" plain
                                            "* %?"
                                            :target (file+head "%<%Y-%m-%d>.org" "#+title: %<%Y-%m-%d>\n")
                                            :unnarrowed t)
                                           ("a" "daily plan" plain
                                            (file "~/Code/dotfiles/doom/snippets/org-roam/daily.org")
                                            :target (file+head "%<%Y-%m-%d>.org" "#+title: %<%Y-%m-%d>\n"))))
(setq org-roam-capture-templates '(("d" "default" plain
                                    (file "~/Code/dotfiles/doom/snippets/org-roam/default.org")
                                    :target (file+head  "%<%Y%m%d%H%M%S>-${slug}.org"  "#+title: ${title}\n#+date: %U\n")
                                    :unnarrowed t)
                                   ("l" "programming language" plain
                                    (file "~/Code/dotfiles/doom/snippets/org-roam/programming.org")
                                    :target (file+head "%<%Y%m%d%H%M%S>-${slug}.org" "#+title: ${title}\n#+date: %U\n#+filetags: programming\n")
                                    :unnarrowed t)
                                   ("b" "book notes" plain
                                    (file "~/Code/dotfiles/doom/snippets/org-roam/book.org")
                                    :target (file+head "%<%Y%m%d%H%M%S>-${slug}.org" "#+title: ${title}\n#+date: %U\n#+filetags: book\n")
                                    :unnarrowed t)
                                   ("p" "project" plain
                                    (file "~/Code/dotfiles/doom/snippets/org-roam/project.org")
                                    :target (file+head  "%<%Y%m%d%H%M%S>-${slug}.org" "#+title: ${title}\n#+date: %U\n#+filetags: project\n")
                                    :unnarrowed t)
                                   ("c" "code" plain
                                    (file "~/Code/dotfiles/doom/snippets/org-roam/code.org")
                                    :target (file+head "%<%Y%m%d%H%M%S>-${slug}.org"  "#+title: ${title}\n#+date: %U\n#+filetags: interview\n")
                                    :unnarrowed t)))
