doom/config.org
* compilation
Use ~comint~ and ~compile~ to ease project compilation
#+begin_src emacs-lisp :results silent
(defun beno--mvn-root-dir ()
  (or (locate-dominating-file buffer-file-name ".git")
      (projectile-project-root)))

(defun beno--run-mvn-command (command)
  (interactive "sCommand: ")
  (let ((default-directory (beno--mvn-root-dir))
        (compilation-read-command nil)
        (compile-command (format "sh mvn %s" command)))
    (call-interactively #'compile)))

(defun beno--mvn-project-tests (project-path)
  "Extract java TESTS at PROJECT-PATH."
  (-filter (lambda (filename) (or (s-contains? "IT.java" filename)
                                  (s-contains? "Test.java" filename)))
           (-map (lambda (filepath) (-last-item  (s-split "/" filepath)))
                 (f-files project-path nil t))))

(defun beno--mvn-test-to-run (test-name)
  "Prompt for TEST-NAME to run."
  (interactive
   (list  (ivy-read "Test to run: "
                    (beno--mvn-project-tests (beno--mvn-root-dir)))))
  (format "clean -DfailIfNoTests=false -Dtest=%s test" test-name))
#+end_src

* projectile
** variable
#+begin_src emacs-lisp
(setq
 projectile-project-search-path '("~/Code/" "~/common-lisp" "~/Code/archives/Code"))
#+end_src

** java .project conflict
doom uses ~.project~ to mark projects so it adds it as a projectile marker. However the java language server also generates ~.project~ file for each imported module. In a multi-module java setting, projectile ends up considering each sub-module as project instead of the root project. Remove ~.project~ as a project marker since I don't use doom projects anyway
#+begin_src emacs-lisp
(after! projectile
  (setq projectile-project-root-files-bottom-up
        (remove ".project" projectile-project-root-files-bottom-up)))
#+end_src

** java projectile commands
commands run at the project level
#+begin_src emacs-lisp
(after! lsp-java
  (setq  projectile-project-test-cmd "sh mvn clean test"
         projectile-project-compilation-cmd "sh mvn clean compile"
         projectile-project-install-cmd "sh mvn clean install"
         projectile-project-package-cmd "sh mvn clean verify"
         projectile-project-run-cmd "docker run --rm --dns 1.1.1.1 -p 8080:8080 -p 5990:5990 -p 5700:5700 -e SPOTIFY_DOMAIN=gew1.spotify.net -e SPOTIFY_POD=gew1 $(jq -r '.image' target/jib-image.json)")
  (map! :leader
        :desc "Verify project"
        :n "p P"
        'projectile-package-project))
#+end_src

* window management
#+begin_src emacs-lisp
;; (set-popup-rule! "^2022" :size 0.40 :vslot -4 :select t :ttl t :quit nil :side 'right)
;; (set-popup-rule! "^2021" :size 0.40 :vslot -4 :select t :ttl t :quit nil :side 'right)
;; (set-popup-rule! "^\\*Org Agenda" :side 'bottom :size 0.90 :select t :ttl nil)
;; (set-popup-rule! "^CAPTURE.*\\.org$" :side 'bottom :size 0.90 :select t :ttl nil)
;; (set-popup-rule! "org$" :size 0.33 :vslot -4 :select t :ttl t :quit nil :side 'right)
(if (> (display-pixel-width) 3000)
    ;; large display
    (progn
      (set-popup-rule! +main-eshell-popup+ :size 0.33 :vslot -4 :select t :quit nil :ttl t :side 'right)
      (set-popup-rule! "*SQL:" :size 0.33 :vslot -4 :select t :quit nil :ttl t :side 'bottom)
      (set-popup-rule! "^\\*compilation.*" :size 0.33 :vslot -4 :select t :quit nil :ttl t :side 'right)
      (set-popup-rule! "^\\*Org Agenda\\*" :size 0.33 :vslot -4 :select t :quit nil :ttl t :side 'right)
      (set-popup-rule! "[0-9]+-[0-9]+-[0-9]+.org" :size 0.33 :vslot -4 :select t :quit 'other :ttl 5 :side 'right :autosave t)
      (set-popup-rule! "journal.org" :size 0.25 :vslot -4 :select t :quit 'other :ttl 5 :side 'right :autosave t)
      (set-popup-rule! "^[0-9]\\{8\\}$" :size 0.33 :vslot -4 :select t :quit 'other :ttl nil :side 'right :autosave t)
      (set-popup-rule! "*kubel" :size 0.50 :vslot -4 :select t :quit nil :ttl t :side 'right))
  ;; small display
  (progn
    ;; (set-popup-rule! +main-eshell-popup+ :size 0.25 :vslot -4 :select t :quit nil :ttl t :side 'bottom)
    ;; (set-popup-rule! "^\\*compilation.*" :size 0.25 :vslot -4 :select t :quit nil :ttl t :side 'bottom)
    (set-popup-rule! "*SQL:" :size 0.25 :vslot -4 :select t :quit nil :ttl t :side 'bottom)
    ;; (set-popup-rule! "^\\*Org Agenda\\*" :size 0.25 :vslot -4 :select t :quit nil :ttl t :side 'right)
    ;; (set-popup-rule! "[0-9]+-[0-9]+-[0-9]+.org" :size 0.25 :vslot -4 :select t :quit 'other :ttl 5 :side 'right :autosave t)
    ;; (set-popup-rule! "journal.org" :size 0.25 :vslot -4 :select t :quit 'other :ttl 5 :side 'right :autosave t)
    ;; (set-popup-rule! "^[0-9]\\{8\\}$" :size 0.25 :vslot -4 :select t :quit 'other :ttl 5 :side 'right :autosave t)
    ))
#+end_src

* vertico-posframe
disabled because it significantly decreases display performance
#+begin_src emacs-lisp
;; (vertico-posframe-mode 1)
;; (setq vertico-posframe-parameters
;;       '((left-fringe . 8)
;;         (right-fringe . 8)))
#+end_src

* hide title bar
Emacs 29 allows you to hide the title bar, no need to compile emacs with title bar removed
#+begin_src emacs-lisp
(add-to-list 'default-frame-alist '(undecorated . t))
#+end_src

* elfeed
#+begin_src emacs-lisp
(add-hook 'elfeed-search-mode-hook #'elfeed-update)
#+end_src

* guile

#+begin_src emacs-lisp
(with-eval-after-load 'geiser-guile
  (add-to-list 'geiser-guile-load-path "/home/ben/Code/guix-turtle")
  ;; (add-to-list 'geiser-guile-load-path "/home/ben/Code/guix")
  )
#+end_src

* info colors

#+begin_src emacs-lisp
;; (use-package! info-colors
;;   :after info
;;   :commands (info-colors-fontify-node)
;;   :hook (Info-selection . info-colors-fontify-node))
#+end_src

* notmuch

#+begin_src emacs-lisp
(after! notmuch
  (setq +notmuch-sync-backend 'mbsync)
  ;; (after! notmuch
  ;;   (setq notmuch-show-log nil
  ;;         notmuch-hello-sections `(notmuch-hello-insert-saved-searches
  ;;                                  notmuch-hello-insert-alltags)
  ;;         ;; To hide headers while composing an email
  ;;         notmuch-message-headers-visible nil))
  (setq notmuch-saved-searches '((:name "inbox" :query "tag:inbox not tag:trash" :key "i")
                                 ;; (:name "flagged" :query "tag:flagged" :key "f")
                                 ;; (:name "sent" :query "tag:sent" :key "s")
                                 ;; (:name "drafts" :query "tag:draft" :key "d")
                                 (:name "spotify" :query "tag:spotify" :key "s")
                                 (:name "gmail" :query "tag:gmail" :key "g")
                                 (:name "protonmail" :query "tag:protonmail" :key "p")
                                 (:name "spotify-unread" :query "tag:spotify and tag:unread" :key "S")
                                 (:name "gmail-unread" :query "tag:gmail and tag:unread" :key "G")
                                 (:name "protonmail-unread" :query "tag:protonmail and tag:unread" :key "P")))

  (set-popup-rule! "^\\*notmuch-hello" :ignore t)
  (set-popup-rule! "^\\*notmuch-saved" :ignore t)

  (map! :localleader
        :map (notmuch-hello-mode-map notmuch-search-mode-map notmuch-tree-mode-map notmuch-show-mode-map)
        :desc "Compose email"   "c" #'+notmuch/compose
        :desc "Sync email"      "u" #'+notmuch/update
        :desc "Quit notmuch"    "q" #'+notmuch/quit
        :desc "Mark as read"    "r" #'notmuch-show-mark-read
        :map notmuch-search-mode-map
        :desc "Mark as deleted" "d" #'+notmuch/search-delete
        :desc "Mark as spam"    "s" #'+notmuch/search-spam
        :map notmuch-tree-mode-map
        :desc "Mark as deleted" "d" #'+notmuch/tree-delete
        :desc "Mark as spam"    "s" #'+notmuch/tree-spam))
#+end_src

