doom/config.el

(remove-hook '+doom-dashboard-functions #'doom-dashboard-widget-shortmenu)
(remove-hook '+doom-dashboard-functions #'doom-dashboard-widget-footer)
(remove-hook '+doom-dashboard-functions #'doom-dashboard-widget-loaded)

;; (global-subword-mode 1)

(setq evil-split-window-below t
      evil-vsplit-window-right t)

(unless (string= "" (shell-command-to-string "pgrep stumpwm"))
  (set-frame-parameter (selected-frame) 'alpha-background 90)
  (add-to-list 'default-frame-alist '(alpha-background . 90)))

(global-org-modern-mode)

(after! modus-themes
  (setq modus-themes-syntax '(faint alt-syntax green-strings yellow-comments))
  (setq modus-themes-italic-constructs nil
        modus-themes-bold-constructs nil
        modus-themes-variable-pitch-ui nil
        modus-themes-mixed-fonts nil)

  (setq modus-themes-prompts '(bold))
  (setq modus-themes-completions nil)
  (setq modus-themes-org-blocks 'gray-background))
